<?xml version="1.0"?>
<CastXML format="1.2.1">

  <Function id="_336" name="sqlite3_snapshot_recover" returns="_366" context="_1" location="f2:9757" file="f2" line="9757" mangled="_Z24sqlite3_snapshot_recover">
    <Argument name="db" type="_370" location="f2:9757" file="f2" line="9757"/>
    <Argument name="zDb" type="_365" location="f2:9757" file="f2" line="9757"/>
  </Function>
  <Function id="_337" name="sqlite3_serialize" returns="_571" context="_1" location="f2:9795" file="f2" line="9795" mangled="_Z17sqlite3_serialize">
    <Argument name="db" type="_370" location="f2:9796" file="f2" line="9796"/>
    <Argument name="zSchema" type="_365" location="f2:9797" file="f2" line="9797"/>
    <Argument name="piSize" type="_531" location="f2:9798" file="f2" line="9798"/>
    <Argument name="mFlags" type="_440" location="f2:9799" file="f2" line="9799"/>
  </Function>
  <Function id="_338" name="sqlite3_deserialize" returns="_366" context="_1" location="f2:9847" file="f2" line="9847" mangled="_Z19sqlite3_deserialize">
    <Argument name="db" type="_370" location="f2:9848" file="f2" line="9848"/>
    <Argument name="zSchema" type="_365" location="f2:9849" file="f2" line="9849"/>
    <Argument name="pData" type="_571" location="f2:9850" file="f2" line="9850"/>
    <Argument name="szDb" type="_20" location="f2:9851" file="f2" line="9851"/>
    <Argument name="szBuf" type="_20" location="f2:9852" file="f2" line="9852"/>
    <Argument name="mFlags" type="_440" location="f2:9853" file="f2" line="9853"/>
  </Function>
  <Struct id="_339" name="sqlite3_rtree_geometry" context="_1" location="f2:9946" file="f2" line="9946" members="_572 _573 _574 _575 _576" size="320" align="64"/>
  <Typedef id="_340" name="sqlite3_rtree_geometry" type="_577" context="_1" location="f2:9916" file="f2" line="9916"/>
  <Struct id="_341" name="sqlite3_rtree_query_info" context="_1" location="f2:9978" file="f2" line="9978" members="_578 _579 _580 _581 _582 _583 _584 _585 _586 _587 _588 _589 _590 _591 _592 _593" size="896" align="64"/>
  <Typedef id="_342" name="sqlite3_rtree_query_info" type="_594" context="_1" location="f2:9917" file="f2" line="9917"/>
  <Typedef id="_343" name="sqlite3_rtree_dbl" type="_453" context="_1" location="f2:9925" file="f2" line="9925"/>
  <Function id="_344" name="sqlite3_rtree_geometry_callback" returns="_366" context="_1" location="f2:9934" file="f2" line="9934" mangled="_Z31sqlite3_rtree_geometry_callback">
    <Argument name="db" type="_370" location="f2:9935" file="f2" line="9935"/>
    <Argument name="zGeom" type="_365" location="f2:9936" file="f2" line="9936"/>
    <Argument name="xGeom" type="_595" location="f2:9937" file="f2" line="9937"/>
    <Argument name="pContext" type="_372" location="f2:9938" file="f2" line="9938"/>
  </Function>
  <Function id="_345" name="sqlite3_rtree_query_callback" returns="_366" context="_1" location="f2:9960" file="f2" line="9960" mangled="_Z28sqlite3_rtree_query_callback">
    <Argument name="db" type="_370" location="f2:9961" file="f2" line="9961"/>
    <Argument name="zQueryFunc" type="_365" location="f2:9962" file="f2" line="9962"/>
    <Argument name="xQueryFunc" type="_596" location="f2:9963" file="f2" line="9963"/>
    <Argument name="pContext" type="_372" location="f2:9964" file="f2" line="9964"/>
    <Argument name="xDestructor" type="_452" location="f2:9965" file="f2" line="9965"/>
  </Function>
  <Struct id="_346" name="Fts5ExtensionApi" context="_1" location="f2:11952" file="f2" line="11952" members="_597 _598 _599 _600 _601 _602 _603 _604 _605 _606 _607 _608 _609 _610 _611 _612 _613 _614 _615 _616" size="1280" align="64"/>
  <Typedef id="_347" name="Fts5ExtensionApi" type="_617" context="_1" location="f2:11724" file="f2" line="11724" comment="c1"/>
  <Struct id="_348" name="Fts5Context" context="_1" location="f2:11725" file="f2" line="11725" incomplete="1"/>
  <Typedef id="_349" name="Fts5Context" type="_618" context="_1" location="f2:11725" file="f2" line="11725"/>
  <Struct id="_350" name="Fts5PhraseIter" context="_1" location="f2:11736" file="f2" line="11736" members="_619 _620" size="128" align="64"/>
  <Typedef id="_351" name="Fts5PhraseIter" type="_621" context="_1" location="f2:11726" file="f2" line="11726"/>
  <Typedef id="_352" name="fts5_extension_function" type="_622" context="_1" location="f2:11728" file="f2" line="11728"/>
  <Struct id="_353" name="Fts5Tokenizer" context="_1" location="f2:12186" file="f2" line="12186" incomplete="1"/>
  <Typedef id="_354" name="Fts5Tokenizer" type="_623" context="_1" location="f2:12186" file="f2" line="12186" comment="c2"/>
  <Struct id="_355" name="fts5_tokenizer" context="_1" location="f2:12188" file="f2" line="12188" members="_624 _625 _626" size="192" align="64"/>
  <Typedef id="_356" name="fts5_tokenizer" type="_627" context="_1" location="f2:12187" file="f2" line="12187"/>
  <Struct id="_357" name="fts5_api" context="_1" location="f2:12224" file="f2" line="12224" members="_628 _629 _630 _631" size="256" align="64"/>
  <Typedef id="_358" name="fts5_api" type="_632" context="_1" location="f2:12223" file="f2" line="12223" comment="c3"/>
  <FundamentalType id="_359" name="__int128" size="128" align="128"/>
  <FundamentalType id="_360" name="unsigned __int128" size="128" align="128"/>
  <Struct id="_361" name="__NSConstantString_tag" context="_1" location="f0:0" file="f0" line="0" members="_633 _634 _635 _636" size="256" align="64"/>
  <PointerType id="_362" type="_530" size="64" align="64"/>
  <ArrayType id="_363" min="0" max="0" type="_637"/>
  <ArrayType id="_364" min="0" max="" type="_530c"/>
  <PointerType id="_365" type="_530c" size="64" align="64"/>
  <FundamentalType id="_366" name="int" size="32" align="32"/>
  <ElaboratedType id="_367" type="_16"/>
  <FundamentalType id="_368" name="long long int" size="64" align="64"/>
  <FundamentalType id="_369" name="long long unsigned int" size="64" align="64"/>
  <PointerType id="_370" type="_17" size="64" align="64"/>
  <PointerType id="_371" type="_638" size="64" align="64"/>
  <PointerType id="_372" type="_431" size="64" align="64"/>
  <PointerType id="_373" type="_362" size="64" align="64"/>
  <Field id="_374" name="pMethods" type="_639" context="_26" access="public" location="f2:686" file="f2" line="686" offset="0"/>
  <ElaboratedType id="_375" type="_26"/>
  <ElaboratedType id="_376" type="_29"/>
  <Field id="_377" name="iVersion" type="_366" context="_29" access="public" location="f2:785" file="f2" line="785" offset="0"/>
  <Field id="_378" name="xClose" type="_640" context="_29" access="public" location="f2:786" file="f2" line="786" offset="64"/>
  <Field id="_379" name="xRead" type="_641" context="_29" access="public" location="f2:787" file="f2" line="787" offset="128"/>
  <Field id="_380" name="xWrite" type="_642" context="_29" access="public" location="f2:788" file="f2" line="788" offset="192"/>
  <Field id="_381" name="xTruncate" type="_643" context="_29" access="public" location="f2:789" file="f2" line="789" offset="256"/>
  <Field id="_382" name="xSync" type="_644" context="_29" access="public" location="f2:790" file="f2" line="790" offset="320"/>
  <Field id="_383" name="xFileSize" type="_645" context="_29" access="public" location="f2:791" file="f2" line="791" offset="384"/>
  <Field id="_384" name="xLock" type="_644" context="_29" access="public" location="f2:792" file="f2" line="792" offset="448"/>
  <Field id="_385" name="xUnlock" type="_644" context="_29" access="public" location="f2:793" file="f2" line="793" offset="512"/>
  <Field id="_386" name="xCheckReservedLock" type="_646" context="_29" access="public" location="f2:794" file="f2" line="794" offset="576"/>
  <Field id="_387" name="xFileControl" type="_647" context="_29" access="public" location="f2:795" file="f2" line="795" offset="640"/>
  <Field id="_388" name="xSectorSize" type="_640" context="_29" access="public" location="f2:796" file="f2" line="796" offset="704"/>
  <Field id="_389" name="xDeviceCharacteristics" type="_640" context="_29" access="public" location="f2:797" file="f2" line="797" offset="768"/>
  <Field id="_390" name="xShmMap" type="_648" context="_29" access="public" location="f2:799" file="f2" line="799" offset="832"/>
  <Field id="_391" name="xShmLock" type="_649" context="_29" access="public" location="f2:800" file="f2" line="800" offset="896"/>
  <Field id="_392" name="xShmBarrier" type="_650" context="_29" access="public" location="f2:801" file="f2" line="801" offset="960"/>
  <Field id="_393" name="xShmUnmap" type="_644" context="_29" access="public" location="f2:802" file="f2" line="802" offset="1024"/>
  <Field id="_394" name="xFetch" type="_651" context="_29" access="public" location="f2:804" file="f2" line="804" offset="1088"/>
  <Field id="_395" name="xUnfetch" type="_652" context="_29" access="public" location="f2:805" file="f2" line="805" offset="1152"/>
  <ElaboratedType id="_396" type="_30"/>
  <ElaboratedType id="_397" type="_32"/>
  <Field id="_398" name="iVersion" type="_366" context="_34" access="public" location="f2:1371" file="f2" line="1371" offset="0"/>
  <Field id="_399" name="szOsFile" type="_366" context="_34" access="public" location="f2:1372" file="f2" line="1372" offset="32"/>
  <Field id="_400" name="mxPathname" type="_366" context="_34" access="public" location="f2:1373" file="f2" line="1373" offset="64"/>
  <Field id="_401" name="pNext" type="_516" context="_34" access="public" location="f2:1374" file="f2" line="1374" offset="128"/>
  <Field id="_402" name="zName" type="_365" context="_34" access="public" location="f2:1375" file="f2" line="1375" offset="192"/>
  <Field id="_403" name="pAppData" type="_372" context="_34" access="public" location="f2:1376" file="f2" line="1376" offset="256"/>
  <Field id="_404" name="xOpen" type="_653" context="_34" access="public" location="f2:1377" file="f2" line="1377" offset="320"/>
  <Field id="_405" name="xDelete" type="_654" context="_34" access="public" location="f2:1379" file="f2" line="1379" offset="384"/>
  <Field id="_406" name="xAccess" type="_655" context="_34" access="public" location="f2:1380" file="f2" line="1380" offset="448"/>
  <Field id="_407" name="xFullPathname" type="_656" context="_34" access="public" location="f2:1381" file="f2" line="1381" offset="512"/>
  <Field id="_408" name="xDlOpen" type="_657" context="_34" access="public" location="f2:1382" file="f2" line="1382" offset="576"/>
  <Field id="_409" name="xDlError" type="_658" context="_34" access="public" location="f2:1383" file="f2" line="1383" offset="640"/>
  <Field id="_410" name="xDlSym" type="_659" context="_34" access="public" location="f2:1384" file="f2" line="1384" offset="704"/>
  <Field id="_411" name="xDlClose" type="_660" context="_34" access="public" location="f2:1385" file="f2" line="1385" offset="768"/>
  <Field id="_412" name="xRandomness" type="_661" context="_34" access="public" location="f2:1386" file="f2" line="1386" offset="832"/>
  <Field id="_413" name="xSleep" type="_662" context="_34" access="public" location="f2:1387" file="f2" line="1387" offset="896"/>
  <Field id="_414" name="xCurrentTime" type="_663" context="_34" access="public" location="f2:1388" file="f2" line="1388" offset="960"/>
  <Field id="_415" name="xGetLastError" type="_661" context="_34" access="public" location="f2:1389" file="f2" line="1389" offset="1024"/>
  <Field id="_416" name="xCurrentTimeInt64" type="_664" context="_34" access="public" location="f2:1394" file="f2" line="1394" offset="1088"/>
  <Field id="_417" name="xSetSystemCall" type="_665" context="_34" access="public" location="f2:1399" file="f2" line="1399" offset="1152"/>
  <Field id="_418" name="xGetSystemCall" type="_666" context="_34" access="public" location="f2:1400" file="f2" line="1400" offset="1216"/>
  <Field id="_419" name="xNextSystemCall" type="_667" context="_34" access="public" location="f2:1401" file="f2" line="1401" offset="1280"/>
  <ElaboratedType id="_420" type="_34"/>
  <PointerType id="_421" type="_668" size="64" align="64"/>
  <Field id="_422" name="xMalloc" type="_669" context="_43" access="public" location="f2:1668" file="f2" line="1668" offset="0"/>
  <Field id="_423" name="xFree" type="_452" context="_43" access="public" location="f2:1669" file="f2" line="1669" offset="64"/>
  <Field id="_424" name="xRealloc" type="_670" context="_43" access="public" location="f2:1670" file="f2" line="1670" offset="128"/>
  <Field id="_425" name="xSize" type="_442" context="_43" access="public" location="f2:1671" file="f2" line="1671" offset="192"/>
  <Field id="_426" name="xRoundup" type="_671" context="_43" access="public" location="f2:1672" file="f2" line="1672" offset="256"/>
  <Field id="_427" name="xInit" type="_442" context="_43" access="public" location="f2:1673" file="f2" line="1673" offset="320"/>
  <Field id="_428" name="xShutdown" type="_452" context="_43" access="public" location="f2:1674" file="f2" line="1674" offset="384"/>
  <Field id="_429" name="pAppData" type="_372" context="_43" access="public" location="f2:1675" file="f2" line="1675" offset="448"/>
  <ElaboratedType id="_430" type="_43"/>
  <FundamentalType id="_431" name="void" size="0" align="8"/>
  <PointerType id="_432" type="_431c" size="64" align="64"/>
  <CvQualifiedType id="_431c" type="_431" const="1"/>
  <PointerType id="_433" type="_672" size="64" align="64"/>
  <PointerType id="_434" type="_373" size="64" align="64"/>
  <PointerType id="_435" type="_366" size="64" align="64"/>
  <PointerType id="_436" type="_637" size="64" align="64"/>
  <PointerType id="_437" type="_673" size="64" align="64"/>
  <PointerType id="_438" type="_674" size="64" align="64"/>
  <PointerType id="_439" type="_675" size="64" align="64"/>
  <FundamentalType id="_440" name="unsigned int" size="32" align="32"/>
  <PointerType id="_441" type="_676" size="64" align="64"/>
  <PointerType id="_442" type="_677" size="64" align="64"/>
  <PointerType id="_443" type="_370" size="64" align="64"/>
  <PointerType id="_444" type="_27" size="64" align="64"/>
  <PointerType id="_445" type="_365" size="64" align="64"/>
  <ElaboratedType id="_446" type="_93"/>
  <PointerType id="_447" type="_449" size="64" align="64"/>
  <PointerType id="_448" type="_432" size="64" align="64"/>
  <PointerType id="_449" type="_94" size="64" align="64"/>
  <ElaboratedType id="_450" type="_108"/>
  <ElaboratedType id="_451" type="_110"/>
  <PointerType id="_452" type="_678" size="64" align="64"/>
  <FundamentalType id="_453" name="double" size="64" align="64"/>
  <FundamentalType id="_454" name="unsigned char" size="8" align="8"/>
  <PointerType id="_455" type="_109c" size="64" align="64"/>
  <CvQualifiedType id="_109c" type="_109" const="1"/>
  <PointerType id="_456" type="_454c" size="64" align="64"/>
  <CvQualifiedType id="_454c" type="_454" const="1"/>
  <PointerType id="_457" type="_109" size="64" align="64"/>
  <PointerType id="_458" type="_679" size="64" align="64"/>
  <PointerType id="_459" type="_680" size="64" align="64"/>
  <PointerType id="_460" type="_111" size="64" align="64"/>
  <PointerType id="_461" type="_681" size="64" align="64"/>
  <PointerType id="_462" type="_682" size="64" align="64"/>
  <PointerType id="_463" type="_683" size="64" align="64"/>
  <PointerType id="_464" type="_684" size="64" align="64"/>
  <FundamentalType id="_465" name="long unsigned int" size="64" align="64"/>
  <PointerType id="_466" type="_685" size="64" align="64"/>
  <Field id="_467" name="pModule" type="_512" context="_241" access="public" location="f2:7062" file="f2" line="7062" offset="0"/>
  <Field id="_468" name="nRef" type="_366" context="_241" access="public" location="f2:7063" file="f2" line="7063" offset="64"/>
  <Field id="_469" name="zErrMsg" type="_362" context="_241" access="public" location="f2:7064" file="f2" line="7064" offset="128"/>
  <ElaboratedType id="_470" type="_241"/>
  <Field id="_471" name="nConstraint" type="_366" context="_243" access="public" location="f2:6917" file="f2" line="6917" offset="0"/>
  <Field id="_472" name="aConstraint" type="_686" context="_243" access="public" location="f2:6923" file="f2" line="6923" offset="64"/>
  <Field id="_473" name="nOrderBy" type="_366" context="_243" access="public" location="f2:6924" file="f2" line="6924" offset="128"/>
  <Field id="_474" name="aOrderBy" type="_687" context="_243" access="public" location="f2:6928" file="f2" line="6928" offset="192"/>
  <Field id="_475" name="aConstraintUsage" type="_688" context="_243" access="public" location="f2:6933" file="f2" line="6933" offset="256"/>
  <Field id="_476" name="idxNum" type="_366" context="_243" access="public" location="f2:6934" file="f2" line="6934" offset="320"/>
  <Field id="_477" name="idxStr" type="_362" context="_243" access="public" location="f2:6935" file="f2" line="6935" offset="384"/>
  <Field id="_478" name="needToFreeIdxStr" type="_366" context="_243" access="public" location="f2:6936" file="f2" line="6936" offset="448"/>
  <Field id="_479" name="orderByConsumed" type="_366" context="_243" access="public" location="f2:6937" file="f2" line="6937" offset="480"/>
  <Field id="_480" name="estimatedCost" type="_453" context="_243" access="public" location="f2:6938" file="f2" line="6938" offset="512"/>
  <Field id="_481" name="estimatedRows" type="_20" context="_243" access="public" location="f2:6940" file="f2" line="6940" offset="576"/>
  <Field id="_482" name="idxFlags" type="_366" context="_243" access="public" location="f2:6942" file="f2" line="6942" offset="640"/>
  <Field id="_483" name="colUsed" type="_21" context="_243" access="public" location="f2:6944" file="f2" line="6944" offset="704"/>
  <ElaboratedType id="_484" type="_243"/>
  <Field id="_485" name="pVtab" type="_689" context="_245" access="public" location="f2:7086" file="f2" line="7086" offset="0"/>
  <ElaboratedType id="_486" type="_245"/>
  <Field id="_487" name="iVersion" type="_366" context="_247" access="public" location="f2:6776" file="f2" line="6776" offset="0"/>
  <Field id="_488" name="xCreate" type="_690" context="_247" access="public" location="f2:6777" file="f2" line="6777" offset="64"/>
  <Field id="_489" name="xConnect" type="_690" context="_247" access="public" location="f2:6780" file="f2" line="6780" offset="128"/>
  <Field id="_490" name="xBestIndex" type="_691" context="_247" access="public" location="f2:6783" file="f2" line="6783" offset="192"/>
  <Field id="_491" name="xDisconnect" type="_692" context="_247" access="public" location="f2:6784" file="f2" line="6784" offset="256"/>
  <Field id="_492" name="xDestroy" type="_692" context="_247" access="public" location="f2:6785" file="f2" line="6785" offset="320"/>
  <Field id="_493" name="xOpen" type="_693" context="_247" access="public" location="f2:6786" file="f2" line="6786" offset="384"/>
  <Field id="_494" name="xClose" type="_694" context="_247" access="public" location="f2:6787" file="f2" line="6787" offset="448"/>
  <Field id="_495" name="xFilter" type="_695" context="_247" access="public" location="f2:6788" file="f2" line="6788" offset="512"/>
  <Field id="_496" name="xNext" type="_694" context="_247" access="public" location="f2:6790" file="f2" line="6790" offset="576"/>
  <Field id="_497" name="xEof" type="_694" context="_247" access="public" location="f2:6791" file="f2" line="6791" offset="640"/>
  <Field id="_498" name="xColumn" type="_696" context="_247" access="public" location="f2:6792" file="f2" line="6792" offset="704"/>
  <Field id="_499" name="xRowid" type="_697" context="_247" access="public" location="f2:6793" file="f2" line="6793" offset="768"/>
  <Field id="_500" name="xUpdate" type="_698" context="_247" access="public" location="f2:6794" file="f2" line="6794" offset="832"/>
  <Field id="_501" name="xBegin" type="_692" context="_247" access="public" location="f2:6795" file="f2" line="6795" offset="896"/>
  <Field id="_502" name="xSync" type="_692" context="_247" access="public" location="f2:6796" file="f2" line="6796" offset="960"/>
  <Field id="_503" name="xCommit" type="_692" context="_247" access="public" location="f2:6797" file="f2" line="6797" offset="1024"/>
  <Field id="_504" name="xRollback" type="_692" context="_247" access="public" location="f2:6798" file="f2" line="6798" offset="1088"/>
  <Field id="_505" name="xFindFunction" type="_699" context="_247" access="public" location="f2:6799" file="f2" line="6799" offset="1152"/>
  <Field id="_506" name="xRename" type="_700" context="_247" access="public" location="f2:6802" file="f2" line="6802" offset="1216"/>
  <Field id="_507" name="xSavepoint" type="_701" context="_247" access="public" location="f2:6805" file="f2" line="6805" offset="1280"/>
  <Field id="_508" name="xRelease" type="_701" context="_247" access="public" location="f2:6806" file="f2" line="6806" offset="1344"/>
  <Field id="_509" name="xRollbackTo" type="_701" context="_247" access="public" location="f2:6807" file="f2" line="6807" offset="1408"/>
  <Field id="_510" name="xShadowName" type="_702" context="_247" access="public" location="f2:6810" file="f2" line="6810" offset="1472"/>
  <ElaboratedType id="_511" type="_247"/>
  <PointerType id="_512" type="_248c" size="64" align="64"/>
  <CvQualifiedType id="_248c" type="_248" const="1"/>
  <ElaboratedType id="_513" type="_254"/>
  <PointerType id="_514" type="_515" size="64" align="64"/>
  <PointerType id="_515" type="_255" size="64" align="64"/>
  <PointerType id="_516" type="_35" size="64" align="64"/>
  <PointerType id="_517" type="_31" size="64" align="64"/>
  <Field id="_518" name="xMutexInit" type="_703" context="_270" access="public" location="f2:7591" file="f2" line="7591" offset="0"/>
  <Field id="_519" name="xMutexEnd" type="_703" context="_270" access="public" location="f2:7592" file="f2" line="7592" offset="64"/>
  <Field id="_520" name="xMutexAlloc" type="_704" context="_270" access="public" location="f2:7593" file="f2" line="7593" offset="128"/>
  <Field id="_521" name="xMutexFree" type="_705" context="_270" access="public" location="f2:7594" file="f2" line="7594" offset="192"/>
  <Field id="_522" name="xMutexEnter" type="_705" context="_270" access="public" location="f2:7595" file="f2" line="7595" offset="256"/>
  <Field id="_523" name="xMutexTry" type="_706" context="_270" access="public" location="f2:7596" file="f2" line="7596" offset="320"/>
  <Field id="_524" name="xMutexLeave" type="_705" context="_270" access="public" location="f2:7597" file="f2" line="7597" offset="384"/>
  <Field id="_525" name="xMutexHeld" type="_706" context="_270" access="public" location="f2:7598" file="f2" line="7598" offset="448"/>
  <Field id="_526" name="xMutexNotheld" type="_706" context="_270" access="public" location="f2:7599" file="f2" line="7599" offset="512"/>
  <ElaboratedType id="_527" type="_270"/>
  <ElaboratedType id="_528" type="_280"/>
  <PointerType id="_529" type="_281" size="64" align="64"/>
  <FundamentalType id="_530" name="char" size="8" align="8"/>
  <CvQualifiedType id="_530c" type="_530" const="1"/>
  <PointerType id="_531" type="_20" size="64" align="64"/>
  <ElaboratedType id="_532" type="_297"/>
  <Field id="_533" name="pBuf" type="_372" context="_299" access="public" location="f2:8346" file="f2" line="8346" offset="0"/>
  <Field id="_534" name="pExtra" type="_372" context="_299" access="public" location="f2:8347" file="f2" line="8347" offset="64"/>
  <ElaboratedType id="_535" type="_299"/>
  <Field id="_536" name="iVersion" type="_366" context="_301" access="public" location="f2:8511" file="f2" line="8511" offset="0"/>
  <Field id="_537" name="pArg" type="_372" context="_301" access="public" location="f2:8512" file="f2" line="8512" offset="64"/>
  <Field id="_538" name="xInit" type="_442" context="_301" access="public" location="f2:8513" file="f2" line="8513" offset="128"/>
  <Field id="_539" name="xShutdown" type="_452" context="_301" access="public" location="f2:8514" file="f2" line="8514" offset="192"/>
  <Field id="_540" name="xCreate" type="_707" context="_301" access="public" location="f2:8515" file="f2" line="8515" offset="256"/>
  <Field id="_541" name="xCachesize" type="_708" context="_301" access="public" location="f2:8516" file="f2" line="8516" offset="320"/>
  <Field id="_542" name="xPagecount" type="_709" context="_301" access="public" location="f2:8517" file="f2" line="8517" offset="384"/>
  <Field id="_543" name="xFetch" type="_710" context="_301" access="public" location="f2:8518" file="f2" line="8518" offset="448"/>
  <Field id="_544" name="xUnpin" type="_711" context="_301" access="public" location="f2:8519" file="f2" line="8519" offset="512"/>
  <Field id="_545" name="xRekey" type="_712" context="_301" access="public" location="f2:8520" file="f2" line="8520" offset="576"/>
  <Field id="_546" name="xTruncate" type="_713" context="_301" access="public" location="f2:8522" file="f2" line="8522" offset="640"/>
  <Field id="_547" name="xDestroy" type="_714" context="_301" access="public" location="f2:8523" file="f2" line="8523" offset="704"/>
  <Field id="_548" name="xShrink" type="_714" context="_301" access="public" location="f2:8524" file="f2" line="8524" offset="768"/>
  <ElaboratedType id="_549" type="_301"/>
  <Field id="_550" name="pArg" type="_372" context="_303" access="public" location="f2:8534" file="f2" line="8534" offset="0"/>
  <Field id="_551" name="xInit" type="_442" context="_303" access="public" location="f2:8535" file="f2" line="8535" offset="64"/>
  <Field id="_552" name="xShutdown" type="_452" context="_303" access="public" location="f2:8536" file="f2" line="8536" offset="128"/>
  <Field id="_553" name="xCreate" type="_715" context="_303" access="public" location="f2:8537" file="f2" line="8537" offset="192"/>
  <Field id="_554" name="xCachesize" type="_708" context="_303" access="public" location="f2:8538" file="f2" line="8538" offset="256"/>
  <Field id="_555" name="xPagecount" type="_709" context="_303" access="public" location="f2:8539" file="f2" line="8539" offset="320"/>
  <Field id="_556" name="xFetch" type="_716" context="_303" access="public" location="f2:8540" file="f2" line="8540" offset="384"/>
  <Field id="_557" name="xUnpin" type="_717" context="_303" access="public" location="f2:8541" file="f2" line="8541" offset="448"/>
  <Field id="_558" name="xRekey" type="_718" context="_303" access="public" location="f2:8542" file="f2" line="8542" offset="512"/>
  <Field id="_559" name="xTruncate" type="_713" context="_303" access="public" location="f2:8543" file="f2" line="8543" offset="576"/>
  <Field id="_560" name="xDestroy" type="_714" context="_303" access="public" location="f2:8544" file="f2" line="8544" offset="640"/>
  <ElaboratedType id="_561" type="_303"/>
  <ElaboratedType id="_562" type="_305"/>
  <PointerType id="_563" type="_306" size="64" align="64"/>
  <PointerType id="_564" type="_719" size="64" align="64"/>
  <PointerType id="_565" type="_720" size="64" align="64"/>
  <PointerType id="_566" type="_244" size="64" align="64"/>
  <Field id="_567" name="hidden" type="_721" context="_330" access="public" location="f2:9590" file="f2" line="9590" offset="0"/>
  <ElaboratedType id="_568" type="_330"/>
  <PointerType id="_569" type="_570" size="64" align="64"/>
  <PointerType id="_570" type="_331" size="64" align="64"/>
  <PointerType id="_571" type="_454" size="64" align="64"/>
  <Field id="_572" name="pContext" type="_372" context="_339" access="public" location="f2:9947" file="f2" line="9947" offset="0"/>
  <Field id="_573" name="nParam" type="_366" context="_339" access="public" location="f2:9948" file="f2" line="9948" offset="64"/>
  <Field id="_574" name="aParam" type="_722" context="_339" access="public" location="f2:9949" file="f2" line="9949" offset="128"/>
  <Field id="_575" name="pUser" type="_372" context="_339" access="public" location="f2:9950" file="f2" line="9950" offset="192"/>
  <Field id="_576" name="xDelUser" type="_452" context="_339" access="public" location="f2:9951" file="f2" line="9951" offset="256"/>
  <ElaboratedType id="_577" type="_339"/>
  <Field id="_578" name="pContext" type="_372" context="_341" access="public" location="f2:9979" file="f2" line="9979" offset="0"/>
  <Field id="_579" name="nParam" type="_366" context="_341" access="public" location="f2:9980" file="f2" line="9980" offset="64"/>
  <Field id="_580" name="aParam" type="_722" context="_341" access="public" location="f2:9981" file="f2" line="9981" offset="128"/>
  <Field id="_581" name="pUser" type="_372" context="_341" access="public" location="f2:9982" file="f2" line="9982" offset="192"/>
  <Field id="_582" name="xDelUser" type="_452" context="_341" access="public" location="f2:9983" file="f2" line="9983" offset="256"/>
  <Field id="_583" name="aCoord" type="_722" context="_341" access="public" location="f2:9984" file="f2" line="9984" offset="320"/>
  <Field id="_584" name="anQueue" type="_723" context="_341" access="public" location="f2:9985" file="f2" line="9985" offset="384"/>
  <Field id="_585" name="nCoord" type="_366" context="_341" access="public" location="f2:9986" file="f2" line="9986" offset="448"/>
  <Field id="_586" name="iLevel" type="_366" context="_341" access="public" location="f2:9987" file="f2" line="9987" offset="480"/>
  <Field id="_587" name="mxLevel" type="_366" context="_341" access="public" location="f2:9988" file="f2" line="9988" offset="512"/>
  <Field id="_588" name="iRowid" type="_20" context="_341" access="public" location="f2:9989" file="f2" line="9989" offset="576"/>
  <Field id="_589" name="rParentScore" type="_343" context="_341" access="public" location="f2:9990" file="f2" line="9990" offset="640"/>
  <Field id="_590" name="eParentWithin" type="_366" context="_341" access="public" location="f2:9991" file="f2" line="9991" offset="704"/>
  <Field id="_591" name="eWithin" type="_366" context="_341" access="public" location="f2:9992" file="f2" line="9992" offset="736"/>
  <Field id="_592" name="rScore" type="_343" context="_341" access="public" location="f2:9993" file="f2" line="9993" offset="768"/>
  <Field id="_593" name="apSqlParam" type="_724" context="_341" access="public" location="f2:9995" file="f2" line="9995" offset="832"/>
  <ElaboratedType id="_594" type="_341"/>
  <PointerType id="_595" type="_725" size="64" align="64"/>
  <PointerType id="_596" type="_726" size="64" align="64"/>
  <Field id="_597" name="iVersion" type="_366" context="_346" access="public" location="f2:11953" file="f2" line="11953" offset="0"/>
  <Field id="_598" name="xUserData" type="_727" context="_346" access="public" location="f2:11955" file="f2" line="11955" offset="64"/>
  <Field id="_599" name="xColumnCount" type="_728" context="_346" access="public" location="f2:11957" file="f2" line="11957" offset="128"/>
  <Field id="_600" name="xRowCount" type="_729" context="_346" access="public" location="f2:11958" file="f2" line="11958" offset="192"/>
  <Field id="_601" name="xColumnTotalSize" type="_730" context="_346" access="public" location="f2:11959" file="f2" line="11959" offset="256"/>
  <Field id="_602" name="xTokenize" type="_731" context="_346" access="public" location="f2:11961" file="f2" line="11961" offset="320"/>
  <Field id="_603" name="xPhraseCount" type="_728" context="_346" access="public" location="f2:11967" file="f2" line="11967" offset="384"/>
  <Field id="_604" name="xPhraseSize" type="_732" context="_346" access="public" location="f2:11968" file="f2" line="11968" offset="448"/>
  <Field id="_605" name="xInstCount" type="_733" context="_346" access="public" location="f2:11970" file="f2" line="11970" offset="512"/>
  <Field id="_606" name="xInst" type="_734" context="_346" access="public" location="f2:11971" file="f2" line="11971" offset="576"/>
  <Field id="_607" name="xRowid" type="_735" context="_346" access="public" location="f2:11973" file="f2" line="11973" offset="640"/>
  <Field id="_608" name="xColumnText" type="_736" context="_346" access="public" location="f2:11974" file="f2" line="11974" offset="704"/>
  <Field id="_609" name="xColumnSize" type="_737" context="_346" access="public" location="f2:11975" file="f2" line="11975" offset="768"/>
  <Field id="_610" name="xQueryPhrase" type="_738" context="_346" access="public" location="f2:11977" file="f2" line="11977" offset="832"/>
  <Field id="_611" name="xSetAuxdata" type="_739" context="_346" access="public" location="f2:11980" file="f2" line="11980" offset="896"/>
  <Field id="_612" name="xGetAuxdata" type="_740" context="_346" access="public" location="f2:11981" file="f2" line="11981" offset="960"/>
  <Field id="_613" name="xPhraseFirst" type="_741" context="_346" access="public" location="f2:11983" file="f2" line="11983" offset="1024"/>
  <Field id="_614" name="xPhraseNext" type="_742" context="_346" access="public" location="f2:11984" file="f2" line="11984" offset="1088"/>
  <Field id="_615" name="xPhraseFirstColumn" type="_743" context="_346" access="public" location="f2:11986" file="f2" line="11986" offset="1152"/>
  <Field id="_616" name="xPhraseNextColumn" type="_744" context="_346" access="public" location="f2:11987" file="f2" line="11987" offset="1216"/>
  <ElaboratedType id="_617" type="_346"/>
  <ElaboratedType id="_618" type="_348"/>
  <Field id="_619" name="a" type="_456" context="_350" access="public" location="f2:11737" file="f2" line="11737" offset="0"/>
  <Field id="_620" name="b" type="_456" context="_350" access="public" location="f2:11738" file="f2" line="11738" offset="64"/>
  <ElaboratedType id="_621" type="_350"/>
  <PointerType id="_622" type="_745" size="64" align="64"/>
  <ElaboratedType id="_623" type="_353"/>
  <Field id="_624" name="xCreate" type="_746" context="_355" access="public" location="f2:12189" file="f2" line="12189" offset="0"/>
  <Field id="_625" name="xDelete" type="_747" context="_355" access="public" location="f2:12190" file="f2" line="12190" offset="64"/>
  <Field id="_626" name="xTokenize" type="_748" context="_355" access="public" location="f2:12191" file="f2" line="12191" offset="128"/>
  <ElaboratedType id="_627" type="_355"/>
  <Field id="_628" name="iVersion" type="_366" context="_357" access="public" location="f2:12225" file="f2" line="12225" offset="0"/>
  <Field id="_629" name="xCreateTokenizer" type="_749" context="_357" access="public" location="f2:12228" file="f2" line="12228" offset="64"/>
  <Field id="_630" name="xFindTokenizer" type="_750" context="_357" access="public" location="f2:12237" file="f2" line="12237" offset="128"/>
  <Field id="_631" name="xCreateFunction" type="_751" context="_357" access="public" location="f2:12245" file="f2" line="12245" offset="192"/>
  <ElaboratedType id="_632" type="_357"/>
  <Field id="_633" name="isa" type="_752" context="_361" access="public" offset="0"/>
  <Field id="_634" name="flags" type="_366" context="_361" access="public" offset="64"/>
  <Field id="_635" name="str" type="_365" context="_361" access="public" offset="128"/>
  <Field id="_636" name="length" type="_753" context="_361" access="public" offset="192"/>
  <Struct id="_637" name="__va_list_tag" context="_1" location="f0:0" file="f0" line="0" members="_754 _755 _756 _757" size="192" align="64"/>
  <PointerType id="_639" type="_758c" size="64" align="64"/>
  <PointerType id="_640" type="_759" size="64" align="64"/>
  <PointerType id="_641" type="_760" size="64" align="64"/>
  <PointerType id="_642" type="_761" size="64" align="64"/>
  <PointerType id="_643" type="_762" size="64" align="64"/>
  <PointerType id="_644" type="_763" size="64" align="64"/>
  <PointerType id="_645" type="_764" size="64" align="64"/>
  <PointerType id="_646" type="_765" size="64" align="64"/>
  <PointerType id="_647" type="_766" size="64" align="64"/>
  <PointerType id="_648" type="_767" size="64" align="64"/>
  <PointerType id="_649" type="_768" size="64" align="64"/>
  <PointerType id="_650" type="_769" size="64" align="64"/>
  <PointerType id="_651" type="_770" size="64" align="64"/>
  <PointerType id="_652" type="_771" size="64" align="64"/>
  <PointerType id="_653" type="_772" size="64" align="64"/>
  <PointerType id="_654" type="_773" size="64" align="64"/>
  <PointerType id="_655" type="_774" size="64" align="64"/>
  <PointerType id="_656" type="_775" size="64" align="64"/>
  <PointerType id="_657" type="_776" size="64" align="64"/>
  <PointerType id="_658" type="_777" size="64" align="64"/>
  <PointerType id="_659" type="_778" size="64" align="64"/>
  <PointerType id="_660" type="_779" size="64" align="64"/>
  <PointerType id="_661" type="_780" size="64" align="64"/>
  <PointerType id="_662" type="_781" size="64" align="64"/>
  <PointerType id="_663" type="_782" size="64" align="64"/>
  <PointerType id="_664" type="_783" size="64" align="64"/>
  <PointerType id="_665" type="_784" size="64" align="64"/>
  <PointerType id="_666" type="_785" size="64" align="64"/>
  <PointerType id="_667" type="_786" size="64" align="64"/>
  <PointerType id="_669" type="_787" size="64" align="64"/>
  <PointerType id="_670" type="_788" size="64" align="64"/>
  <PointerType id="_671" type="_789" size="64" align="64"/>
  <PointerType id="_686" type="_790" size="64" align="64"/>
  <PointerType id="_687" type="_791" size="64" align="64"/>
  <PointerType id="_688" type="_792" size="64" align="64"/>
  <PointerType id="_689" type="_242" size="64" align="64"/>
  <PointerType id="_690" type="_793" size="64" align="64"/>
  <PointerType id="_691" type="_794" size="64" align="64"/>
  <PointerType id="_692" type="_795" size="64" align="64"/>
  <PointerType id="_693" type="_796" size="64" align="64"/>
  <PointerType id="_694" type="_797" size="64" align="64"/>
  <PointerType id="_695" type="_798" size="64" align="64"/>
  <PointerType id="_696" type="_799" size="64" align="64"/>
  <PointerType id="_697" type="_800" size="64" align="64"/>
  <PointerType id="_698" type="_801" size="64" align="64"/>
  <PointerType id="_699" type="_802" size="64" align="64"/>
  <PointerType id="_700" type="_803" size="64" align="64"/>
  <PointerType id="_701" type="_804" size="64" align="64"/>
  <PointerType id="_702" type="_805" size="64" align="64"/>
  <PointerType id="_703" type="_806" size="64" align="64"/>
  <PointerType id="_704" type="_807" size="64" align="64"/>
  <PointerType id="_705" type="_808" size="64" align="64"/>
  <PointerType id="_706" type="_809" size="64" align="64"/>
  <PointerType id="_707" type="_810" size="64" align="64"/>
  <PointerType id="_708" type="_811" size="64" align="64"/>
  <PointerType id="_709" type="_812" size="64" align="64"/>
  <PointerType id="_710" type="_813" size="64" align="64"/>
  <PointerType id="_711" type="_814" size="64" align="64"/>
  <PointerType id="_712" type="_815" size="64" align="64"/>
  <PointerType id="_713" type="_816" size="64" align="64"/>
  <PointerType id="_714" type="_817" size="64" align="64"/>
  <PointerType id="_715" type="_818" size="64" align="64"/>
  <PointerType id="_716" type="_819" size="64" align="64"/>
  <PointerType id="_717" type="_820" size="64" align="64"/>
  <PointerType id="_718" type="_821" size="64" align="64"/>
  <ArrayType id="_721" min="0" max="47" type="_454"/>
  <PointerType id="_722" type="_343" size="64" align="64"/>
  <PointerType id="_723" type="_440" size="64" align="64"/>
  <PointerType id="_724" type="_457" size="64" align="64"/>
  <PointerType id="_727" type="_822" size="64" align="64"/>
  <PointerType id="_728" type="_823" size="64" align="64"/>
  <PointerType id="_729" type="_824" size="64" align="64"/>
  <PointerType id="_730" type="_825" size="64" align="64"/>
  <PointerType id="_731" type="_826" size="64" align="64"/>
  <PointerType id="_732" type="_827" size="64" align="64"/>
  <PointerType id="_733" type="_828" size="64" align="64"/>
  <PointerType id="_734" type="_829" size="64" align="64"/>
  <PointerType id="_735" type="_830" size="64" align="64"/>
  <PointerType id="_736" type="_831" size="64" align="64"/>
  <PointerType id="_737" type="_832" size="64" align="64"/>
  <PointerType id="_738" type="_833" size="64" align="64"/>
  <PointerType id="_739" type="_834" size="64" align="64"/>
  <PointerType id="_740" type="_835" size="64" align="64"/>
  <PointerType id="_741" type="_836" size="64" align="64"/>
  <PointerType id="_742" type="_837" size="64" align="64"/>
  <PointerType id="_743" type="_838" size="64" align="64"/>
  <PointerType id="_744" type="_839" size="64" align="64"/>
  <PointerType id="_746" type="_840" size="64" align="64"/>
  <PointerType id="_747" type="_841" size="64" align="64"/>
  <PointerType id="_748" type="_842" size="64" align="64"/>
  <PointerType id="_749" type="_843" size="64" align="64"/>
  <PointerType id="_750" type="_844" size="64" align="64"/>
  <PointerType id="_751" type="_845" size="64" align="64"/>
  <PointerType id="_752" type="_366c" size="64" align="64"/>
  <CvQualifiedType id="_366c" type="_366" const="1"/>
  <FundamentalType id="_753" name="long int" size="64" align="64"/>
  <Field id="_754" name="gp_offset" type="_440" context="_637" access="public" offset="0"/>
  <Field id="_755" name="fp_offset" type="_440" context="_637" access="public" offset="32"/>
  <Field id="_756" name="overflow_arg_area" type="_372" context="_637" access="public" offset="64"/>
  <Field id="_757" name="reg_save_area" type="_372" context="_637" access="public" offset="128"/>
  <CvQualifiedType id="_758c" type="_758" const="1"/>
  <FunctionType id="_638" returns="_366">
    <Argument type="_372"/>
    <Argument type="_366"/>
    <Argument type="_373"/>
    <Argument type="_373"/>
  </FunctionType>
  <FunctionType id="_668" returns="_431"/>
  <FunctionType id="_672" returns="_366">
    <Argument type="_372"/>
    <Argument type="_366"/>
  </FunctionType>
  <FunctionType id="_673" returns="_366">
    <Argument type="_372"/>
    <Argument type="_366"/>
    <Argument type="_365"/>
    <Argument type="_365"/>
    <Argument type="_365"/>
    <Argument type="_365"/>
  </FunctionType>
  <FunctionType id="_674" returns="_431">
    <Argument type="_372"/>
    <Argument type="_365"/>
  </FunctionType>
  <FunctionType id="_675" returns="_431">
    <Argument type="_372"/>
    <Argument type="_365"/>
    <Argument type="_21"/>
  </FunctionType>
  <FunctionType id="_676" returns="_366">
    <Argument type="_440"/>
    <Argument type="_372"/>
    <Argument type="_372"/>
    <Argument type="_372"/>
  </FunctionType>
  <FunctionType id="_677" returns="_366">
    <Argument type="_372"/>
  </FunctionType>
  <FunctionType id="_678" returns="_431">
    <Argument type="_372"/>
  </FunctionType>
  <FunctionType id="_679" returns="_431">
    <Argument type="_460"/>
    <Argument type="_366"/>
    <Argument type="_724"/>
  </FunctionType>
  <FunctionType id="_680" returns="_431">
    <Argument type="_460"/>
  </FunctionType>
  <FunctionType id="_681" returns="_431">
    <Argument type="_372"/>
    <Argument type="_20"/>
    <Argument type="_366"/>
  </FunctionType>
  <FunctionType id="_682" returns="_366">
    <Argument type="_372"/>
    <Argument type="_366"/>
    <Argument type="_432"/>
    <Argument type="_366"/>
    <Argument type="_432"/>
  </FunctionType>
  <FunctionType id="_683" returns="_431">
    <Argument type="_372"/>
    <Argument type="_370"/>
    <Argument type="_366"/>
    <Argument type="_365"/>
  </FunctionType>
  <FunctionType id="_684" returns="_431">
    <Argument type="_372"/>
    <Argument type="_370"/>
    <Argument type="_366"/>
    <Argument type="_432"/>
  </FunctionType>
  <FunctionType id="_685" returns="_431">
    <Argument type="_372"/>
    <Argument type="_366"/>
    <Argument type="_365"/>
    <Argument type="_365"/>
    <Argument type="_20"/>
  </FunctionType>
  <FunctionType id="_719" returns="_431">
    <Argument type="_846"/>
    <Argument type="_366"/>
  </FunctionType>
  <FunctionType id="_720" returns="_366">
    <Argument type="_372"/>
    <Argument type="_370"/>
    <Argument type="_365"/>
    <Argument type="_366"/>
  </FunctionType>
  <FunctionType id="_725" returns="_366">
    <Argument type="_847"/>
    <Argument type="_366"/>
    <Argument type="_722"/>
    <Argument type="_435"/>
  </FunctionType>
  <FunctionType id="_726" returns="_366">
    <Argument type="_848"/>
  </FunctionType>
  <FunctionType id="_745" returns="_431">
    <Argument type="_849"/>
    <Argument type="_850"/>
    <Argument type="_460"/>
    <Argument type="_366"/>
    <Argument type="_724"/>
  </FunctionType>
  <ElaboratedType id="_758" type="_29"/>
  <FunctionType id="_759" returns="_366">
    <Argument type="_444"/>
  </FunctionType>
  <FunctionType id="_760" returns="_366">
    <Argument type="_444"/>
    <Argument type="_372"/>
    <Argument type="_366"/>
    <Argument type="_20"/>
  </FunctionType>
  <FunctionType id="_761" returns="_366">
    <Argument type="_444"/>
    <Argument type="_432"/>
    <Argument type="_366"/>
    <Argument type="_20"/>
  </FunctionType>
  <FunctionType id="_762" returns="_366">
    <Argument type="_444"/>
    <Argument type="_20"/>
  </FunctionType>
  <FunctionType id="_763" returns="_366">
    <Argument type="_444"/>
    <Argument type="_366"/>
  </FunctionType>
  <FunctionType id="_764" returns="_366">
    <Argument type="_444"/>
    <Argument type="_531"/>
  </FunctionType>
